# ColumnBaseAttachJustificationParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ColumnBaseAttachJustificationParam Property
ParameterTypeId Class See Also
---
"Attachment Justification At Base"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ColumnBaseAttachJustificationParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ColumnBaseAttachJustificationParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ColumnBaseAttachJustificationParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace